In [3]:
N = (1 + 4 ) % 5 + 1
print("Варіант ",N)

Варіант  1

In [4]:
## Завдання 1. Виведіть перші 8 рядків набору даних.
import pandas as pd

df = pd.read_csv(r"C:\Users\Gleb\Desktop\NationalNames.csv")
df.head(8)

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746
5   6   Margaret  1880      F   1578
6   7        Ida  1880      F   1472
7   8      Alice  1880      F   1414

In [5]:
## Завдання 2. Вивести останні 8 рядків набору даних.
df.tail(8)

              Id     Name  Year Gender  Count
1825425  1825426       Zo  2014      M      5
1825426  1825427    Zyeir  2014      M      5
1825427  1825428     Zyel  2014      M      5
1825428  1825429   Zykeem  2014      M      5
1825429  1825430   Zymeer  2014      M      5
1825430  1825431  Zymiere  2014      M      5
1825431  1825432    Zyran  2014      M      5
1825432  1825433    Zyrin  2014      M      5

In [6]:
## Завдання 3. Отримайте імена стовпців набору даних
df.columns

Index(['Id', 'Name', 'Year', 'Gender', 'Count'], dtype='object')

In [7]:
## Завдання 5. Знайдіть кількість унікальних імен у наборі даних.
unique_names_count = df['Name'].nunique()
unique_names_count

93889

In [8]:
## Завдання 10. Підрахуйте кількість унікальних імен у кожному році.
unique_names_by_year = df.groupby(['Year'])[['Name']].nunique()
unique_names_by_year

       Name
Year
1880   1889
1881   1830
1882   2012
1883   1962
1884   2158
...     ...
2010  31603
2011  31418
2012  31236
2013  30774
2014  30579

[135 rows x 1 columns]

In [9]:
## Завдання 11. Знайдіть рік із найбільшою кількістю унікальних імен.
max_unique_year = unique_names_by_year['Name'].idxmax()
unique_names_by_year.loc[[max_unique_year]]

       Name
Year
2008  32488

In [10]:
## Завдання 12. Знайдіть найпопулярніше ім’я в році з найбільшою кількістю унікальних імен (тобто у 2008 році).
_2008year = df.query('Year == @max_unique_year')
max_2008_index = _2008year['Count'].idxmax()
_2008year['Name'].loc[max_2008_index]

'Jacob'

In [11]:
## Завдання 13. Знайдіть рік, коли ім’я “Jacob” було найпопулярнішим серед жіночих імен.
female_jacob = df.query('Name == "Jacob" & Gender == "F"')
max_year_of_jacob = female_jacob['Count'].idxmax()
female_jacob.loc[[max_year_of_jacob]]

              Id   Name  Year Gender  Count
1455556  1455557  Jacob  2004      F    171